openwch/arduino_core_ch32/system/CH32L10x/SRC/Peripheral/src/ch32l103_can.c
    if(NewState)
    {
        CANx->CANFD_CR |= (1<<9);
    }
    else
    {
        CANx->CANFD_CR &= ~(1<<9);
    }
}

/*********************************************************************
 * @fn      CANFD_Init
 *
 * @brief   Initializes the CAN peripheral according to the specified
 *        parameters in the CANFD_InitStruct.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          CANFD_InitStruct - pointer to a CANFD_InitTypeDef structure that
 *        contains the configuration information for the CAN peripheral.
 *
 * @return  InitStatus - CAN InitStatus state.
*             CAN_InitStatus_Failed.
*             CAN_InitStatus_Success.
 */
uint8_t CANFD_Init(CAN_TypeDef* CANx, CANFD_InitTypeDef* CANFD_InitStruct)
{
    uint8_t InitStatus = CAN_InitStatus_Failed;
    uint32_t wait_ack = 0x00000000;

    CANx->CANFD_CR |= 1;

    CANx->CTLR &= (~(uint32_t)CAN_CTLR_SLEEP);
    CANx->CTLR |= CAN_CTLR_INRQ ;

    while (((CANx->STATR & CAN_STATR_INAK) != CAN_STATR_INAK) && (wait_ack != INAK_TIMEOUT))
    {
        wait_ack++;
    }

    if ((CANx->STATR & CAN_STATR_INAK) != CAN_STATR_INAK)
    {
        InitStatus = CAN_InitStatus_Failed;
    }
    else
    {
        if (CANFD_InitStruct->CANFD_TTCM == ENABLE)
        {
            CANx->CTLR |= CAN_CTLR_TTCM;
        }
        else
        {
            CANx->CTLR &= ~(uint32_t)CAN_CTLR_TTCM;
        }

        if (CANFD_InitStruct->CANFD_ABOM == ENABLE)
        {
            CANx->CTLR |= CAN_CTLR_ABOM;
        }
        else
        {
            CANx->CTLR &= ~(uint32_t)CAN_CTLR_ABOM;
        }

        if (CANFD_InitStruct->CANFD_AWUM == ENABLE)
        {
            CANx->CTLR |= CAN_CTLR_AWUM;
        }
        else
        {
            CANx->CTLR &= ~(uint32_t)CAN_CTLR_AWUM;
        }

        if (CANFD_InitStruct->CANFD_NART == ENABLE)
        {
            CANx->CTLR |= CAN_CTLR_NART;
        }
        else
        {
            CANx->CTLR &= ~(uint32_t)CAN_CTLR_NART;
        }

        if (CANFD_InitStruct->CANFD_TXFP == ENABLE)
        {
            CANx->CTLR |= CAN_CTLR_TXFP;
        }
        else
        {
            CANx->CTLR &= ~(uint32_t)CAN_CTLR_TXFP;
        }

        if (CANFD_InitStruct->CANFD_RES_Error == ENABLE)
        {
            CANx->CANFD_CR |= (1<<7);
        }
        else
        {
            CANx->CANFD_CR &= ~(1<<7);
        }

        if (CANFD_InitStruct->CANFD_BRS_TXM0 == ENABLE)
        {
            CANx->CANFD_CR |= (1<<1);
        }
        else
        {
            CANx->CANFD_CR &= ~(1<<1);
        }

        if (CANFD_InitStruct->CANFD_BRS_TXM1 == ENABLE)
        {
            CANx->CANFD_CR |= (1<<2);
        }
        else
        {
            CANx->CANFD_CR &= ~(1<<2);
        }

        if (CANFD_InitStruct->CANFD_BRS_TXM2 == ENABLE)
        {
            CANx->CANFD_CR |= (1<<3);
        }
        else
        {
            CANx->CANFD_CR &= ~(1<<3);
        }

        if (CANFD_InitStruct->CANFD_ESI_Auto_TXM0 == ENABLE)
        {
            CANx->CANFD_CR |= (1<<4);
        }
        else
        {
            CANx->CANFD_CR &= ~(1<<4);
        }

        if (CANFD_InitStruct->CANFD_ESI_Auto_TXM1 == ENABLE)
        {
            CANx->CANFD_CR |= (1<<5);
        }
        else
        {
            CANx->CANFD_CR &= ~(1<<5);
        }

        if (CANFD_InitStruct->CANFD_ESI_Auto_TXM2 == ENABLE)
        {
            CANx->CANFD_CR |= (1<<6);
        }
        else
        {
            CANx->CANFD_CR &= ~(1<<6);
        }

        CANx->CANFD_BTR &= ~(0x009F1FFF);
        CANx->CANFD_TDCT &= ~(0x00003F3F);

        CANx->CANFD_TDCT = (uint32_t)((uint32_t)CANFD_InitStruct->CANFD_TDC_FILTER << 8) | \
                                     ((uint32_t)CANFD_InitStruct->CANFD_TDC0);

        CANx->CANFD_BTR = (uint32_t)((uint32_t)CANFD_InitStruct->CANFD_TDCE << 23) | \
                                    ((uint32_t)CANFD_InitStruct->CANFD_Prescaler-1 << 16) | \
                                    ((uint32_t)CANFD_InitStruct->CANFD_BS1 << 8) | \
                                    ((uint32_t)CANFD_InitStruct->CANFD_BS2 << 4) | \
                                    ((uint32_t)CANFD_InitStruct->CANFD_SJW);

        CANx->CTLR &= ~(uint32_t)CAN_CTLR_INRQ;
        wait_ack = 0;

        while (((CANx->STATR & CAN_STATR_INAK) == CAN_STATR_INAK) && (wait_ack != INAK_TIMEOUT))
        {
            wait_ack++;
        }

        if ((CANx->STATR & CAN_STATR_INAK) == CAN_STATR_INAK)
        {
            InitStatus = CAN_InitStatus_Failed;
        }
        else
        {
            InitStatus = CAN_InitStatus_Success ;
        }
    }

    return InitStatus;
}

/*********************************************************************
 * @fn      CANFD_StructInit
 *
 * @brief   Fills each CANFD_InitStruct member with its default value.
 *
 * @param   CANFD_InitStruct - pointer to a CANFD_InitTypeDef structure which
 *        will be initialized.
 *
 * @return  none
 */
void CANFD_StructInit(CANFD_InitTypeDef* CANFD_InitStruct)
{
    CANFD_InitStruct->CANFD_TTCM = DISABLE;
    CANFD_InitStruct->CANFD_ABOM = DISABLE;
    CANFD_InitStruct->CANFD_AWUM = DISABLE;
    CANFD_InitStruct->CANFD_NART = DISABLE;
    CANFD_InitStruct->CANFD_TXFP = DISABLE;

    CANFD_InitStruct->CANFD_RES_Error = DISABLE;
    CANFD_InitStruct->CANFD_ESI_Auto_TXM0 = DISABLE;
    CANFD_InitStruct->CANFD_ESI_Auto_TXM1 = DISABLE;
    CANFD_InitStruct->CANFD_ESI_Auto_TXM2 = DISABLE;
    CANFD_InitStruct->CANFD_BRS_TXM0 = DISABLE;
    CANFD_InitStruct->CANFD_BRS_TXM1 = DISABLE;
    CANFD_InitStruct->CANFD_BRS_TXM2 = DISABLE;

    CANFD_InitStruct->CANFD_TDC_FILTER = 0;
    CANFD_InitStruct->CANFD_TDC0 = 2;
    CANFD_InitStruct->CANFD_TDCE = ENABLE;

    CANFD_InitStruct->CANFD_Mode = CAN_Mode_Normal;
    CANFD_InitStruct->CANFD_SJW = CANFD_SJW_8tq;
    CANFD_InitStruct->CANFD_BS1 = CANFD_BS1_7tq;
    CANFD_InitStruct->CANFD_BS2 = CANFD_BS2_4tq;
    CANFD_InitStruct->CANFD_Prescaler = 1;
}

/*********************************************************************
 * @fn      CANFD_Transmit
 *
 * @brief   Initiates the transmission of a message for CANFD.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          TxMessage - pointer to a structure which contains CAN Id, CAN
 *        DLC and CAN data.
 *
 * @return  transmit_mailbox - The number of the mailbox that is used for
 *        transmission or CAN_TxStatus_NoMailBox if there is no empty mailbox.
 */
uint8_t CANFD_Transmit(CAN_TypeDef* CANx, CanFDTxMsg* TxMessage)
{
    uint8_t transmit_mailbox = 0;

    CANx->CANFD_CR |= (1);

    if ((CANx->TSTATR&CAN_TSTATR_TME0) == CAN_TSTATR_TME0)
    {
        transmit_mailbox = 0;
    }
    else if ((CANx->TSTATR&CAN_TSTATR_TME1) == CAN_TSTATR_TME1)
    {
        transmit_mailbox = 1;
    }
    else if ((CANx->TSTATR&CAN_TSTATR_TME2) == CAN_TSTATR_TME2)
    {
        transmit_mailbox = 2;
    }
    else
    {
        transmit_mailbox = CAN_TxStatus_NoMailBox;
    }

    if (transmit_mailbox != CAN_TxStatus_NoMailBox)
    {
        CANx->sTxMailBox[transmit_mailbox].TXMIR &= TMIDxR_TXRQ;
        if (TxMessage->IDE == CAN_Id_Standard)
        {
            CANx->sTxMailBox[transmit_mailbox].TXMIR |= ((TxMessage->StdId << 21) | \
                                                        TxMessage->RTR);
        }
        else
        {
            CANx->sTxMailBox[transmit_mailbox].TXMIR |= ((TxMessage->ExtId << 3) | \
                                                        TxMessage->IDE | \
                                                        TxMessage->RTR);
        }

