openwch/arduino_core_ch32/system/CH32L10x/SRC/Peripheral/src/ch32l103_can.c
        TxMessage->DLC &= (uint8_t)0x0000000F;
        CANx->sTxMailBox[transmit_mailbox].TXMDTR &= (uint32_t)0xFFFFFFF0;
        CANx->sTxMailBox[transmit_mailbox].TXMDTR |= TxMessage->DLC;
        CANx->CANFD_DMA_T[transmit_mailbox] = (uint32_t)TxMessage->Data;
        CANx->sTxMailBox[transmit_mailbox].TXMIR |= TMIDxR_TXRQ;
    }

    return transmit_mailbox;
}

/*********************************************************************
 * @fn      CANFD_Receive
 *
 * @brief   Receives a message.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          FIFONumber - Receive FIFO number.
 *            CAN_FIFO0.
 *            CAN_FIFO1.
 *          RxMessage -  pointer to a structure receive message which contains
 *        CAN Id, CAN DLC, CAN datas and FMI number.
 *
 * @return  ErrorStatus - NoREADY or READY.
 */
ErrorStatus CANFD_Receive(CAN_TypeDef* CANx, uint8_t FIFONumber, CanFDRxMsg* RxMessage)
{
    ErrorStatus sta = NoREADY;
    uint8_t len, i;
    uint32_t adr;

    if((CANx->sFIFOMailBox[FIFONumber].RXMIR & 1) == 0) return sta;

    RxMessage->IDE = (uint8_t)0x04 & CANx->sFIFOMailBox[FIFONumber].RXMIR;

    if (RxMessage->IDE == CAN_Id_Standard)
    {
        RxMessage->StdId = (uint32_t)0x000007FF & (CANx->sFIFOMailBox[FIFONumber].RXMIR >> 21);
    }
    else
    {
        RxMessage->ExtId = (uint32_t)0x1FFFFFFF & (CANx->sFIFOMailBox[FIFONumber].RXMIR >> 3);
    }

    RxMessage->RTR = (uint8_t)0x02 & CANx->sFIFOMailBox[FIFONumber].RXMIR;

    len = (uint8_t)0x0F & CANx->sFIFOMailBox[FIFONumber].RXMDTR;

    if(len <= 8)
    {
        RxMessage->DLC = len;
    }
    else if(len <= 12)
    {
        RxMessage->DLC = (len - 6) * 4;
    }
    else if(len <= 15)
    {
        RxMessage->DLC = (len - 11) * 16;
    }

    RxMessage->FMI = (uint8_t)0xFF & (CANx->sFIFOMailBox[FIFONumber].RXMDTR >> 8);
    RxMessage->BRS = (uint8_t)0x01 & (CANx->sFIFOMailBox[FIFONumber].RXMDTR >> 4);
    RxMessage->ESI = (uint8_t)0x01 & (CANx->sFIFOMailBox[FIFONumber].RXMDTR >> 5);
    RxMessage->RES = (uint8_t)0x01 & (CANx->sFIFOMailBox[FIFONumber].RXMDTR >> 6);

    adr = CANx->CANFD_DMA_R[FIFONumber] + 0x20000000;

    for(i=0; i<RxMessage->DLC; i++)
    {
        RxMessage->Data[i] = *((uint8_t*)adr++);
    }

    if (FIFONumber == CAN_FIFO0)
    {
        CANx->RFIFO0 |= CAN_RFIFO0_RFOM0;
    }
    else
    {
        CANx->RFIFO1 |= CAN_RFIFO1_RFOM1;
    }

    sta = READY;

    return sta;
}


/*********************************************************************
 * @fn      CANFD_GetTransmitDelayOffsetVal
 *
 * @brief   Returns the CANx Transmit Delay Offset Value.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *
 * @return  val - CAN Transmit Delay Offset Value.
 */
uint8_t CANFD_GetTransmitDelayOffsetVal(CAN_TypeDef *CANx)
{
    uint8_t val=0;

    val = (uint8_t)((CANx->CANFD_PSR & 0x00FF0000)>> 16);

    return val;
}

/*********************************************************************
 * @fn      CANFD_TransmitMailbox_DMAAdr
 *
 * @brief   Set Transmit Mailbox DMA address.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          MailboxNumber - Transmit Mailbox.
 *            CAN_Transmit_Mailbox0.
 *            CAN_Transmit_Mailbox1.
 *            CAN_Transmit_Mailbox2.
 *          address - DMA address.
 *
 * @return  none.
 */
void CANFD_TransmitMailbox_DMAAdr(CAN_TypeDef *CANx, uint8_t MailboxNumber, uint32_t Address)
{
    CANx->CANFD_DMA_T[MailboxNumber] = Address;
}

/*********************************************************************
 * @fn      CANFD_ReceiveFIFO_DMAAdr
 *
 * @brief   Set receives FIFO DMA address.
 *
 * @param   CANx - where x can be 1 to select the CAN peripheral.
 *          FIFONumber - Receive FIFO number.
 *            CAN_FIFO0.
 *            CAN_FIFO1.
 *          address - DMA address.
 *
 * @return  none.
 */
void CANFD_ReceiveFIFO_DMAAdr(CAN_TypeDef *CANx, uint8_t FIFONumber, uint32_t Address)
{
    CANx->CANFD_DMA_R[FIFONumber] = Address;
}
